Tekla Open API Reference for Tekla Structures 2025
HatchAttributes.DrawBackgroundColor Property
 Sets whether the background color will be enabled or disabled for the hatch. See also: BackgroundColor.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawBackgroundColor { get; set; }
Public Property DrawBackgroundColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace